[{"id":59,"date":"2010-05-26T10:19:06","date_gmt":"2010-05-26T10:19:06","guid":{"rendered":"http://scott.cloudcontrol.me/?p=59"},"modified":"2017-12-16T19:59:15","modified_gmt":"2017-12-16T19:59:15","slug":"an-open-source-education","status":"publish","type":"post","link":"https://api.scott.ee/journal/an-open-source-education/","title":{"rendered":"An Open Source Education"},"content":{"rendered":"\n<p class=\"intro\">On 1st May 2008 I launched <a title=\"Pixie: the small, simple, site maker\" href=\"http://www.getpixie.co.uk\">Pixie</a>, an open source content management system. Or as I like to say: &ldquo;small, simple, website maker&rdquo;. Two years on its time to share my experience of running a free to own open source project.</p>\n<div id=\"attachment_1512\" style=\"width: 1510px\" class=\"wp-caption alignnone\"><noscript><img class=\"wp-image-1512 size-full\" src=\"https://i2.wp.com/scottsweb.mystagingwebsite.com/wp-content/uploads/journal-open-source-free-beer.jpg?resize=900%2C503&amp;ssl=1\" alt=\"Free Beer in bottles, made in Taiwan\" width=\"900\" height=\"503\" srcset=\"https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?w=1500&amp;ssl=1 1500w, https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?resize=250%2C140&amp;ssl=1 250w, https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?resize=768%2C429&amp;ssl=1 768w, https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?resize=700%2C391&amp;ssl=1 700w, https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?resize=120%2C67&amp;ssl=1 120w\" sizes=\"(max-width: 900px) 100vw, 900px\" data-recalc-dims=\"1\"></noscript><div class=\"lazy\" data-width=\"900\" data-height=\"503\" style=\"--ratio:55.89%;\"><img class=\"wp-image-1512 size-full\" src=\"\" alt=\"Free Beer in bottles, made in Taiwan\" width=\"900\" height=\"503\" srcset=\"\" sizes=\"(max-width: 900px) 100vw, 900px\" data-recalc-dims=\"1\" data-src=\"https://i2.wp.com/scottsweb.mystagingwebsite.com/wp-content/uploads/journal-open-source-free-beer.jpg?resize=900%2C503&amp;ssl=1\" data-srcset=\"https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?w=1500&amp;ssl=1 1500w, https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?resize=250%2C140&amp;ssl=1 250w, https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?resize=768%2C429&amp;ssl=1 768w, https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?resize=700%2C391&amp;ssl=1 700w, https://i1.wp.com/api.scott.ee/wp-content/uploads/journal-open-source-free-beer.jpg?resize=120%2C67&amp;ssl=1 120w\"></div><p class=\"wp-caption-text\">Image released under the Creative Commons by <a title=\"Free beer on Flickr\" href=\"http://www.flickr.com/photos/43916253@N00/\" target=\"_blank\" rel=\"noopener\">superflexnet on Flickr</a>.</p></div>\n<p>Pixie was always going to be an open source project. Free to own, free to modify. When I first started putting the project together (around five years ago now) I had already committed to the idea. The Internet relies on free and open source software and Pixie had to be part of that. I believed in it, and for the most part I still do.</p>\n<p>Without a doubt the project has been a success; on a personal level and for getting toggle off the ground. Pixie was the launch platform for our first year in business, it has been deployed by us on many websites and continues to work flawlessly. On top of that Pixie has been downloaded well over 25,000 times, translated into 18 languages and <a title=\"Pixie takes runner up spot as most promising open source CMS\" href=\"http://www.toggle.uk.com/journal/pixie-takes-runner-up-spot-as-most-promising-open-source-cms/\">awarded second place in the Packt open source CMS awards</a> (2009). Pixie has raised our profile and stood its ground against larger projects with more funding, more support and bigger communities.</p>\n<p>Its not all good news though and after a few months of reflection at the start of the year we decided it was time to consider stopping the project. My passion for developing the software started to fade towards the end of last year which coincided with a very difficult time for us. Our finances, jobs and business were on a knife edge.</p>\n<p>So at the start of April I listed Pixie for sale and so far I have been unsuccessful in finding a buyer. Pixie has not sold because it does not generate (easily measurable) revenue and potential buyers are faced with the challenge of monetising a project that requires time, development and support for the community. These are the same reasons it&rsquo;s difficult for a young business like ours to invest time on it and when you look at the numbers it makes for a very interesting story:</p>\n<h3>Help &amp; Support</h3>\n<p>There are 2824 messages in the forum &mdash; if we assume half of those are answers and half are questions that works out to be 1.9 questions per day for the lifespan of the project. Each reply has to be carefully considered and that adds up to a great deal of time. This does not include the personal emails that arrive in my inbox too. The real challenge is that for the project to grow it needs to be supported and realistically that support (at least at the start) needs to be free.</p>\n<h3>Code contributions</h3>\n<p>The number of downloads is fast approaching 30,000 &mdash; out of those people there are only three that I would class as core contributors. That is 0.01% of people giving back to the project and that is not good enough. There are lots of possibilities for why this is: perhaps I could have given the community better tools? maybe lots of people felt it was good enough already? I can only speculate as to why this might have happened but I wish the number was higher.</p>\n<h3>Financial contributions</h3>\n<p>In two years we have had three donations to the project (totalling &pound;70). This leads me to the conclusion that people do not appreciate the amount of time and effort it takes to run and develop such a project. We need to learn to value the things we do not pay for and/or lower our expectations. We have had some fairly insulting emails for taking our time when replying to support questions or because Pixie did not work as expected. Thankfully that has been a minority of people.</p>\n<h3>Advertising &amp; Referrals</h3>\n<p>To try and generate a small and steady income I&rsquo;ve looked at both advertising and partnerships. None have worked out very well. My first attempt was to use <a title=\"Google Adsense\" href=\"https://www.google.com/adsense/\">Google Adsense</a> across the site. After a few months the balance had made it to $30 and at that milestone Google shut our account. The money was gone and there is no appeal procedure to get it back. To this date I am unsure what happened. So I replaced those advert units with ones powered by <a title=\"Buy Sell Adverts\" href=\"http://buysellads.com/\">buysellads.com</a>. To date these adverts have generated $20 and I am unable to claim this money as it does not hit a threshold amount. That money might never make it to my account.</p>\n<p>I also formed a hosting partnership with a company called Arvixe. They pay $70 for each hosting referral I send to them and it started out well. Within a few weeks I had five registrations but I had to wait three months before being paid. As time went on those initial payments disappeared &mdash; apparently they cancelled their accounts before I was paid the referral. Nearly 12 months on and I have only ever had $140 from Arvixe. Referrals no longer show up despite people in the forums claiming they clicked through from the Pixie site.</p>\n<p>Last week I removed all advertising from the Pixie site. It is a real shame when open source projects have to turn to advertising to support themselves. I recently switched my laptop to <a title=\"Ubuntu Linux\" href=\"http://www.ubuntu.com/\">Ubuntu</a> and have been searching around for open source software. Take a look at <a title=\"GIMP like Photoshop\" href=\"http://www.gimpshop.com/\">gimpshop.com</a> &mdash; the site is littered with adverts and you can tell by the language and layout that the developer is struggling. As a result the last release was released a very long time ago. I find it strange that we are happy to spend thousands of pounds on Adobe Creative Suite yet so reluctant to drop the developer of an alternative some beer money.</p>\n<p>Content creators across the web face this same problem every single day and thankfully a new service has appeared that tries to address the issue. It&rsquo;s called <a title=\"Flattr Micropayments\" href=\"https://flattr.com/\">Flattr</a> and I recommend grabbing an account. I have already created a <a title=\"Flattr Pixie\" href=\"https://flattr.com/thing/1202/Pixie-Open-Source-CMS\">Flattr button for Pixie</a> (to test the service) and at the end of the month I will be getting a small income from it, likely to be fractions of Euro. But it&rsquo;s a great start and beats having tacky adverts littered across the site. <a title=\"Flattr this post\" href=\"https://flattr.com/thing/6031/toggle-An-Open-Source-Education\">You can even Flattr this post</a>&hellip; after all, it took weeks to write (I started writing back in March!).</p>\n<h3>What next?</h3>\n<p>Collectively we need to get better at collaborating on open source projects. We all have a part to play and we must learn to appreciate the hard work that goes into the projects we take for granted every single day.</p>\n<p>Despite what it may read like I remain confident in open source. Open platforms will eventually win (see <a title=\"Google vs Apple\" href=\"http://techcrunch.com/2010/05/20/the-gloves-are-officially-off-google-vs-apple/\">Google vs Apple</a>) and the future we all want relies on this being the case. I have plans for some smaller projects that we are going to open source in future&hellip; actually most of my personal projects will either be open source or support open source projects.</p>\n<p>With regards to Pixie I feel I have taken the project as far as I can. I am now trying to decide what the next steps should be. The great thing about open source is that a project can live on regardless of what happens. If you have any ideas I would love to hear them.</p>\n","protected":false},"excerpt":{"rendered":"On 1st May 2008 I launched Pixie, an open source content management system. Two years on its time to share my experience of running a free to own open source project.","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[22],"tags":[],"jetpack_featured_media_url":"","_links":{"self":[{"href":"https://api.scott.ee/wp-json/wp/v2/posts/59"}],"collection":[{"href":"https://api.scott.ee/wp-json/wp/v2/posts"}],"about":[{"href":"https://api.scott.ee/wp-json/wp/v2/types/post"}],"author":[{"embeddable":true,"href":"https://api.scott.ee/wp-json/wp/v2/users/1"}],"replies":[{"embeddable":true,"href":"https://api.scott.ee/wp-json/wp/v2/comments?post=59"}],"version-history":[{"count":2,"href":"https://api.scott.ee/wp-json/wp/v2/posts/59/revisions"}],"predecessor-version":[{"id":1513,"href":"https://api.scott.ee/wp-json/wp/v2/posts/59/revisions/1513"}],"wp:attachment":[{"href":"https://api.scott.ee/wp-json/wp/v2/media?parent=59"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https://api.scott.ee/wp-json/wp/v2/categories?post=59"},{"taxonomy":"post_tag","embeddable":true,"href":"https://api.scott.ee/wp-json/wp/v2/tags?post=59"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]},"_embedded":{"author":[{"id":1,"name":"scottsweb","url":"","description":"","link":"https://api.scott.ee/journal/author/scottsweb/","slug":"scottsweb","_links":{"self":[{"href":"https://api.scott.ee/wp-json/wp/v2/users/1"}],"collection":[{"href":"https://api.scott.ee/wp-json/wp/v2/users"}]}}],"wp:term":[[{"id":22,"link":"https://api.scott.ee/journal/category/open-source/","name":"Open Source","slug":"open-source","taxonomy":"category","_links":{"self":[{"href":"https://api.scott.ee/wp-json/wp/v2/categories/22"}],"collection":[{"href":"https://api.scott.ee/wp-json/wp/v2/categories"}],"about":[{"href":"https://api.scott.ee/wp-json/wp/v2/taxonomies/category"}],"wp:post_type":[{"href":"https://api.scott.ee/wp-json/wp/v2/posts?categories=22"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]}}],[]]},"page":4}]